<?php

use Illuminate\Database\Seeder;
use App\Domain\Categories\Category;

class CategoriesTableSeeder extends Seeder
{
    public static $categories = [
        'Аэродинамика',
        'Воздухоплавание',
        'Агрономия',
        'Анатомия',
        'Ангиология',
        'Антология',
        'Антропология',
        'Арахнология',
        'Археология',
        'Астрономия',
        'Астрофизика',
        'Бактериолоия',
        'Герпетология',
        'Биохимия',
        'Биология',
        'Биофизика',
        'Биотехнология',
        'Ботаника',
        'Химическая инженерия',
        'Химия',
        'Климатология',
        'Информатика',
        'Краниология',
        'Криптография',
        'Цитология',
        'Дерматология',
        'Экология',
        'Электроника',
        'Энтомология',
        'Экология',
        'Этиология',
        'Евгеника',
        'Цветоводство',
        'Генетика',
        'Геология',
        'Геронтология',
        'Гинекология',
        'Гематология',
        'Гепатология',
        'Иконография',
        'Иммунология',
        'Юриспруденция',
        'Лексикография',
        'Математика',
        'Микробиология',
        'Минералогия',
        'Микология',
        'Миология',
        'Нумизматика',
        'Океанография',
        'Офтальмология',
        'Орнитология',
        'Остеология',
        'Палеонтология',
        'Петрология',
        'Филателия',
        'Филология',
        'Фонетика',
        'Альгология',
        'Физика',
        'Помология',
        'Психология',
        'Радиология',
        'Сейсмология',
        'Шелководство',
        'Таксономия',
        'Телепатия',
        'Термодинамика',
        'Токсикология',
        'Вирусология',
        'Зоология'
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach (self::$categories as $category) {
            Category::create([
                'name' => $category
            ]);
        }
    }

}
