<?php

return [
    'fields' => [
        'save' => 'Сохранить',
        'update' => 'Обновить',
        'edit' => 'Изменить',
        'delete' => 'Удалить',
        'send' => 'Отправить',

        'posts' => 'Статьи',
        'users' => 'Пользователи',
        'comments' => 'Комментарии',

        'create_post' => 'Создать статью',
        'edit_post' => 'Изменить статью',
        'comment_on' => 'Комментировать',
        'leave_comment' => 'Оставить комментарий',

        'author' => 'Автор(ы)',
        'title' => 'Заголовок',
        'content' => 'Контент',
    ]
];