<?php

return [
    'fields' => [
        'save' => 'Сохранить',
        'update' => 'Обновить',
        'edit' => 'Изменить',
        'delete' => 'Удалить',
        'send' => 'Отправить',

        'posts' => 'Посты',
        'users' => 'Пользователи',
        'comments' => 'Комментарии',

        'create_post' => 'Создать пост',
        'edit_post' => 'Изменить пост',
        'comment_on' => 'Комментировать',

        'author' => 'Автор',
        'title' => 'Загаловок',
        'content' => 'Контент',
    ]
];